# RESTFul API란?

제가 RESTFul 에서 제일 중요한건 Resource 라고 생각합니다. Resource 중심으로 URI을 설계하고, HTTP Method 를 통해 액션을 잘 구분하는 것만 잘 지켜도 충분히 어느 정도 설계를 잘 지킬수 있다고 생각해요. 즉 URI는 명사 중심으로 하고 HTTP Method 에는 액션을 위임하는 것이라고 생각합니다. 실제 예제로는 어떤 유저의 어떤 책에 접근한다라고 했을 때

`GET /users/{userId}/books/{bookId}`

와 같은 형태로 접근하는 거죠.

예상 질문) RESTFul은 항상 옳을까요?

가끔 권한등의 문제나 가독성 등으로 인해 RESTFul 을 사용하기 힘들 때도 있는데, 개인적으로는 RESTFul을 포기하기도 하지만 그럼에도 불구하고 최대한 지키려고 애쓰는 자세가 중요한 것 같아요.

예상 질문2) GraphQL에 대해서 아시나요?





# Stack and Queue

정확하게 어떤걸 물어보시는 지 모르겠으나 간단하게 설명하자면 보통의 스택의 경우 상자를 쌓듯이 쌓아 올려서 위에서부터 꺼내는 형태이고 즉 먼저 들어간 것이 나중에 나오는 구조입니다. Queue는 양쪽 구명이 뚫린 원통에 밀어넣고 먼저 들어간게 먼저 나오는 구조죠. 보통 줄서는 느낌이랑 비슷하다고 생각되네요.

예상질문1) 우선순위 큐는 어떻게 구현할까요?





# TCP 3-way-handshake

간단하게 클라이언트가 서버에게 서버야 들려?라고 하면 서버가 어 들려! 너도 잘 들리지? 하고 답한 뒤 그 답을 들은 클라이언트가 다시 서버에게 어 나도 잘 들려라고 하는 거라고 생각해요.



예상질문1) 왜 클라가 서버로 보내고 서버가 클라로 보내는 2way로는 안될까요?

TCP 프로토콜의 경우 양방향 연결이기 때문에, 양쪽이 다 잘 들리는 지 확인해야 하기 때문입니다. 전화를 생각해보면 알 수 있는데, 통신상태가 안좋아서 한쪽에서만 소리가 잘들릴 때가 있는데, 이건 양방향 소통이라고 할 수 없겠죠? 때문에 양쪽다 서로 잘들리는 상태에서 대화하는 게 필요하기 때문입니다.





# 스케줄러의 종류

- 장기 스케줄러 - 디스크에 저장하고 메모리에 올릴지 말지 결정하는 스케줄러
- 단기 스케줄러 - 메모리에서 씨피유를 할당할지 말지 결정하는 스케줄러
- 중기 스케줄러 - 메모리에 올린걸 잠시 디스크에 올려두는 스케줄러

# CPU 스케줄러

- FCFS - 먼저온 게 먼저 처리
- SJF - 처리 시간이 짧은 게 먼저 처리
- SRT - 남은 시간이 적은 걸 먼저 처리
- Priority scheduling - 우선순위에 따른 처리
- RR - 모든 프로세스가 동일

- \Index

- Index란 무엇인가
- Index의 자료구조
- Primary index vs Secondary index
- Composite index
- Index의 성능과 고려해야할 사항

- Javascript Hoisting
- Javascript , What is 'This'
